app/views/functional_units/show.html.haml

  %b Owner:
  = @functional_unit.owner.last_name + ', ' + @functional_unit.owner.first_name
---
SELECT "owners".* FROM "owners" WHERE "owners"."id" = 1 LIMIT 1