app/views/companies/show.html.haml

SELECT "franchises".* FROM "franchises" WHERE ("franchises".company_id = 1)
---
    %th
  - @company.franchises.each do |franchise|