app/views/consortia/show.html.haml

SELECT "owners".* FROM "owners" WHERE "owners"."id" = 20 LIMIT 1
---
    %tr
      %td= functional_unit.owner.last_name + ', ' + functional_unit.owner.first_name