app/views/franchises/show.html.haml

SELECT "administrations".* FROM "administrations" WHERE ("administrations".franchise_id = 1)
---
    %th
  - @franchise.administrations.each do |administration|