app/controllers/franchises_controller.rb

SELECT "franchises".* FROM "franchises"
---
  def index
    @franchises = Franchise.all

SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = 1 LIMIT 1
---
  def show
    @franchise = Franchise.find(params[:id])