app/controllers/functional_units_controller.rb

  def index
    @functional_units = FunctionalUnit.order(:owner_id).page(params[ :page ]).per(20)
---
SELECT "functional_units".* FROM "functional_units" ORDER BY owner_id LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "functional_units"

  def show
    @functional_unit = FunctionalUnit.find(params[:id])
---
SELECT "functional_units".* FROM "functional_units" WHERE "functional_units"."id" = 1 LIMIT 1