app/controllers/owners_controller.rb

  def index
    @owners = Owner.order(:last_name).page(params[ :page ]).per(20)
---
SELECT "owners".* FROM "owners" ORDER BY last_name LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "owners"