app/views/administrations/show.html.haml

SELECT "consortia".* FROM "consortia" WHERE ("consortia".administration_id = 1)
---
    %th
  - @administration.consortia.each do |consortium|